{"stoi": {"28607": 0, "3668": 1, "18974": 2, "10473": 3, "24030": 4, "5112": 5, "7290": 6, "11921": 7, "5628": 8, "1771": 9, "21535": 10, "3554": 11, "9862": 12, "11346": 13, "160": 14, "16599": 15, "13013": 16, "28213": 17, "22075": 18, "22508": 19, "7750": 20, "28497": 21, "28097": 22, "28267": 23, "22072": 24, "7913": 25, "8825": 26, "5376": 27, "20669": 28, "5791": 29, "7609": 30, "3664": 31, "27012": 32, "24337": 33, "477": 34, "24051": 35, "11263": 36, "11817": 37, "3546": 38, "13827": 39, "29211": 40, "11459": 41, "4197": 42, "23838": 43, "4331": 44, "11467": 45, "4861": 46, "19862": 47, "21629": 48, "11515": 49, "10175": 50, "2866": 51, "22644": 52, "16616": 53, "15402": 54, "20296": 55, "27688": 56, "7999": 57, "9740": 58, "583": 59, "7968": 60, "2010": 61, "25628": 62, "22904": 63, "18017": 64, "20027": 65, "6505": 66, "16907": 67, "8707": 68, "14599": 69, "22842": 70, "20016": 71, "16935": 72, "14594": 73, "9183": 74, "26369": 75, "6326": 76, "26141": 77, "5738": 78, "5804": 79, "28252": 80, "296": 81, "26500": 82, "16837": 83, "8796": 84, "27965": 85, "3373": 86, "7035": 87, "11395": 88, "16033": 89, "15625": 90, "27480": 91, "22175": 92, "17069": 93, "13150": 94, "27791": 95, "8628": 96, "6710": 97, "18421": 98, "21443": 99, "10396": 100, "5233": 101, "19540": 102, "10336": 103, "19330": 104, "10071": 105, "4608": 106, "8670": 107, "7693": 108, "10528": 109, "23509": 110, "17061": 111, "20204": 112, "9158": 113, "26370": 114, "12111": 115, "5210": 116, "18501": 117, "529": 118, "23199": 119, "25928": 120, "14744": 121, "20075": 122, "28567": 123, "11662": 124, "16433": 125, "18591": 126, "12800": 127, "29222": 128, "21187": 129, "2076": 130, "13202": 131, "17833": 132, "26000": 133, "21773": 134, "29424": 135, "71": 136, "22215": 137, "29482": 138, "5271": 139, "11570": 140, "28472": 141, "17171": 142, "10779": 143, "11377": 144, "13035": 145, "15200": 146, "22294": 147, "3738": 148, "1429": 149, "29898": 150, "8626": 151, "12195": 152, "8228": 153, "25398": 154, "27067": 155, "10045": 156, "13812": 157, "10851": 158, "6459": 159, "17092": 160, "24694": 161, "22649": 162, "9064": 163, "7340": 164, "17309": 165, "28687": 166, "26455": 167, "12188": 168, "12793": 169, "3882": 170, "21439": 171, "5749": 172, "14138": 173, "21942": 174, "2750": 175, "7276": 176, "15190": 177, "13777": 178, "7773": 179, "28693": 180, "17237": 181, "1671": 182, "9957": 183, "16901": 184, "29315": 185, "20852": 186, "9070": 187, "1730": 188, "9557": 189, "18824": 190, "12085": 191, "25153": 192, "28286": 193, "17814": 194, "16366": 195, "3826": 196, "5208": 197, "20205": 198, "29821": 199, "47": 200, "28949": 201, "8318": 202, "7403": 203, "12132": 204, "7025": 205, "13228": 206, "3927": 207, "14861": 208, "792": 209, "24714": 210, "24246": 211, "23411": 212, "25684": 213, "5069": 214, "24219": 215, "4467": 216, "12356": 217, "3393": 218, "2274": 219, "29806": 220, "21054": 221, "2502": 222, "1951": 223, "5350": 224, "5041": 225, "23095": 226, "13242": 227, "4728": 228, "16310": 229, "18436": 230, "9633": 231, "11207": 232, "28924": 233, "19892": 234, "29251": 235, "4853": 236, "8144": 237, "2187": 238, "26211": 239, "6859": 240, "19307": 241, "10054": 242, "24376": 243, "8811": 244, "27020": 245, "7928": 246, "9297": 247, "5410": 248, "6823": 249, "21558": 250, "3666": 251, "29415": 252, "11523": 253, "19694": 254, "22555": 255, "27819": 256, "18435": 257, "10474": 258, "25719": 259, "5373": 260, "11268": 261, "7614": 262, "8124": 263, "5196": 264, "13795": 265, "21943": 266, "19842": 267, "6932": 268, "804": 269, "21222": 270, "7708": 271, "22299": 272, "7597": 273, "26610": 274, "22764": 275, "26956": 276, "20129": 277, "24772": 278, "20626": 279, "24282": 280, "29539": 281, "1491": 282, "20330": 283, "13479": 284, "21257": 285, "9333": 286, "17013": 287, "5179": 288, "24766": 289, "29644": 290, "28471": 291, "3931": 292, "29577": 293, "3203": 294, "19995": 295, "746": 296, "1881": 297, "17793": 298, "13057": 299, "27534": 300, "12110": 301, "27256": 302, "3540": 303, "11852": 304, "21932": 305, "7871": 306, "598": 307, "9576": 308, "27661": 309, "16533": 310, "999": 311, "1962": 312, "25303": 313, "23519": 314, "19163": 315, "29132": 316, "29771": 317, "5533": 318, "9219": 319, "4687": 320, "8057": 321, "20822": 322, "13550": 323, "7021": 324, "29860": 325, "17426": 326, "14713": 327, "19164": 328, "10532": 329, "7271": 330, "22674": 331, "1210": 332, "16241": 333, "22004": 334, "3437": 335, "2815": 336, "14454": 337, "11042": 338, "9623": 339, "11743": 340, "8593": 341, "12750": 342, "21951": 343, "14303": 344, "8741": 345, "25638": 346, "27770": 347, "27707": 348, "27565": 349, "28554": 350, "3893": 351, "11650": 352, "10286": 353, "26115": 354, "22589": 355, "657": 356, "3091": 357, "637": 358, "19652": 359, "21871": 360, "11401": 361, "6230": 362, "25909": 363, "9972": 364, "20999": 365, "20058": 366, "20891": 367, "7845": 368, "4380": 369, "19763": 370, "3798": 371, "2950": 372, "16855": 373, "22974": 374, "5562": 375, "16598": 376, "27476": 377, "14941": 378, "26159": 379, "25360": 380, "4624": 381, "18958": 382, "21933": 383, "19636": 384, "9226": 385, "5629": 386, "5026": 387, "7053": 388, "11741": 389, "7191": 390, "6680": 391, "8055": 392, "20770": 393, "6976": 394, "11324": 395, "14786": 396, "1315": 397, "21767": 398, "9170": 399, "20537": 400, "19151": 401, "25936": 402, "3503": 403, "1437": 404, "21471": 405, "10355": 406, "25911": 407, "15966": 408, "14433": 409, "15820": 410, "2943": 411, "28407": 412, "26227": 413, "22828": 414, "16464": 415, "24910": 416, "12237": 417, "15884": 418, "26435": 419, "6327": 420, "22715": 421, "26880": 422, "14462": 423, "17396": 424, "3006": 425, "13753": 426, "4768": 427, "1257": 428, "8821": 429, "19821": 430, "23314": 431, "6866": 432, "22182": 433, "3335": 434, "24495": 435, "17646": 436, "11677": 437, "22106": 438, "22998": 439, "16979": 440, "3166": 441, "24933": 442, "7019": 443, "10295": 444, "16384": 445, "23721": 446, "24617": 447, "12212": 448, "23394": 449, "24858": 450, "709": 451, "22035": 452, "15468": 453, "11547": 454, "8518": 455, "14048": 456, "1838": 457, "5994": 458, "28954": 459, "26216": 460, "11903": 461, "20683": 462, "7778": 463, "11833": 464, "26432": 465, "24702": 466, "20671": 467, "98": 468, "24843": 469, "2992": 470, "24089": 471, "6782": 472, "28409": 473, "2622": 474, "18125": 475, "10708": 476, "12923": 477, "9955": 478, "6419": 479, "8701": 480, "25493": 481, "24749": 482, "20436": 483, "455": 484, "2272": 485, "7411": 486, "13502": 487, "1433": 488, "131": 489, "13572": 490, "21359": 491, "3942": 492, "23569": 493, "10013": 494, "25681": 495, "4922": 496, "18769": 497, "1071": 498, "15153": 499, "5244": 500, "22518": 501, "20393": 502, "12147": 503, "4294": 504, "13121": 505, "12774": 506, "16021": 507, "19160": 508, "8362": 509, "10504": 510, "22910": 511, "10856": 512, "13395": 513, "25112": 514, "21150": 515, "22184": 516, "8826": 517, "17874": 518, "13901": 519, "19870": 520, "12911": 521, "25332": 522, "10991": 523, "27185": 524, "425": 525, "21961": 526, "8549": 527, "29299": 528, "24805": 529, "29196": 530, "29834": 531, "25815": 532, "1698": 533, "25050": 534, "29153": 535, "8278": 536, "472": 537, "28244": 538, "2759": 539, "24340": 540, "18405": 541, "19368": 542, "27301": 543, "26621": 544, "16841": 545, "17636": 546, "18782": 547, "2441": 548, "22799": 549, "28242": 550, "26532": 551, "20871": 552, "18461": 553, "17399": 554, "23466": 555, "10173": 556, "12103": 557, "28093": 558, "14683": 559, "20235": 560, "25307": 561, "27030": 562, "19662": 563, "20644": 564, "13093": 565, "5735": 566, "26577": 567, "20937": 568, "1000": 569, "28209": 570, "21096": 571, "23635": 572, "23267": 573, "4307": 574, "13446": 575, "22417": 576, "25070": 577, "29112": 578, "20747": 579, "566": 580, "21154": 581, "7091": 582, "9739": 583, "15095": 584, "11406": 585, "25184": 586, "14717": 587, "8794": 588, "11940": 589, "13165": 590, "3431": 591, "18468": 592, "3451": 593, "18781": 594, "8791": 595, "17271": 596, "7370": 597, "28337": 598, "5855": 599, "15372": 600, "4560": 601, "28155": 602, "4562": 603, "6262": 604, "29475": 605, "6157": 606, "18886": 607, "8839": 608, "14076": 609, "20763": 610, "3390": 611, "7872": 612, "20283": 613, "29667": 614, "25243": 615, "29453": 616, "24519": 617, "27317": 618, "1803": 619, "15630": 620, "11818": 621, "1628": 622, "16377": 623, "7410": 624, "13257": 625, "24113": 626, "27998": 627, "9886": 628, "18754": 629, "27288": 630, "28820": 631, "17748": 632, "23481": 633, "26927": 634, "17846": 635, "10900": 636, "24848": 637, "8725": 638, "22832": 639, "1758": 640, "18597": 641, "21380": 642, "9300": 643, "20982": 644, "5775": 645, "29354": 646, "19740": 647, "25094": 648, "22620": 649, "3623": 650, "1379": 651, "11800": 652, "1819": 653, "27070": 654, "3380": 655, "8330": 656, "2527": 657, "14730": 658, "28377": 659, "25160": 660, "8272": 661, "8692": 662, "5892": 663, "10022": 664, "13975": 665, "10579": 666, "12441": 667, "1248": 668, "19557": 669, "22703": 670, "14296": 671, "12448": 672, "10635": 673, "27773": 674, "16322": 675, "2275": 676, "28762": 677, "25811": 678, "20418": 679, "6770": 680, "3717": 681, "2031": 682, "7716": 683, "5348": 684, "28323": 685, "5324": 686, "15397": 687, "14226": 688, "3450": 689, "13453": 690, "17406": 691, "21584": 692, "11261": 693, "4610": 694, "5822": 695, "19826": 696, "7046": 697, "1312": 698, "29960": 699, "28939": 700, "13325": 701, "6149": 702, "11784": 703, "8598": 704, "7720": 705, "21266": 706, "13131": 707, "26332": 708, "29130": 709, "3291": 710, "13579": 711, "25455": 712, "22537": 713, "2164": 714, "18997": 715, "3464": 716, "25940": 717, "11963": 718, "19822": 719, "14152": 720, "18098": 721, "14127": 722, "9498": 723, "16828": 724, "18592": 725, "24664": 726, "15784": 727, "11110": 728, "26517": 729, "26988": 730, "15410": 731, "20896": 732, "28788": 733, "8059": 734, "5128": 735, "6858": 736, "27145": 737, "482": 738, "20312": 739, "4134": 740, "1727": 741, "808": 742, "5355": 743, "24464": 744, "2429": 745, "28780": 746, "11549": 747, "15434": 748, "21299": 749, "2958": 750, "1294": 751, "26505": 752, "9581": 753, "7877": 754, "12219": 755, "28829": 756, "29154": 757, "19213": 758, "27400": 759, "12297": 760, "16362": 761, "5298": 762, "10524": 763, "12001": 764, "9306": 765, "1858": 766, "23367": 767, "28683": 768, "22431": 769, "16287": 770, "16668": 771, "28526": 772, "15802": 773, "9096": 774, "2977": 775, "15916": 776, "24043": 777, "13406": 778, "19902": 779, "14772": 780, "5597": 781, "1561": 782, "28065": 783, "528": 784, "26045": 785, "19637": 786, "19983": 787, "9539": 788, "14845": 789, "13972": 790, "7692": 791, "22023": 792, "921": 793, "12780": 794, "11087": 795, "17289": 796, "4903": 797, "15461": 798, "22362": 799, "3154": 800, "549": 801, "12083": 802, "11292": 803, "19747": 804, "12245": 805, "19834": 806, "29514": 807, "15516": 808, "8118": 809, "28789": 810, "27587": 811, "17955": 812, "22545": 813, "24005": 814, "183": 815, "27064": 816, "29124": 817, "17268": 818, "10139": 819, "17196": 820, "13012": 821, "9394": 822, "29511": 823, "23723": 824, "29996": 825, "24649": 826, "23667": 827, "6311": 828, "19654": 829, "29663": 830, "23137": 831, "8359": 832, "23230": 833, "1016": 834, "21313": 835, "26330": 836, "27784": 837, "143": 838, "12628": 839, "22054": 840, "16607": 841, "15815": 842, "13377": 843, "94": 844, "2649": 845, "18768": 846, "5589": 847, "7385": 848, "5016": 849, "24657": 850, "29101": 851, "7356": 852, "1094": 853, "29384": 854, "25985": 855, "19874": 856, "25212": 857, "12832": 858, "22723": 859, "8040": 860, "18998": 861, "8476": 862, "16703": 863, "7119": 864, "20613": 865, "4756": 866, "27312": 867, "26130": 868, "18195": 869, "19724": 870, "22367": 871, "15893": 872, "190": 873, "3591": 874, "16722": 875, "6718": 876, "20011": 877, "24036": 878, "28707": 879, "2177": 880, "4230": 881, "17364": 882, "28549": 883, "11135": 884, "20748": 885, "3681": 886, "19527": 887, "28084": 888, "20298": 889, "9611": 890, "13501": 891, "2139": 892, "9774": 893, "28594": 894, "6609": 895, "19868": 896, "11556": 897, "19104": 898, "10770": 899, "21079": 900, "27302": 901, "24274": 902, "24010": 903, "26674": 904, "5957": 905, "10294": 906, "21431": 907, "19572": 908, "16050": 909, "18190": 910, "2692": 911, "12270": 912, "198": 913, "18239": 914, "749": 915, "23318": 916, "5845": 917, "20552": 918, "17901": 919, "15782": 920, "2533": 921, "4489": 922, "14361": 923, "5966": 924, "4082": 925, "24684": 926, "26438": 927, "2097": 928, "6032": 929, "28808": 930, "1446": 931, "15867": 932, "20617": 933, "24794": 934, "5603": 935, "8482": 936, "15412": 937, "23360": 938, "18106": 939, "11929": 940, "1": 941, "13174": 942, "22578": 943, "28051": 944, "6568": 945, "11717": 946, "27659": 947, "20329": 948, "27504": 949, "20350": 950, "28105": 951, "5082": 952, "27989": 953, "22268": 954, "13620": 955, "10493": 956, "29693": 957, "25845": 958, "26530": 959, "8377": 960, "1999": 961, "20556": 962, "22967": 963, "2239": 964, "19267": 965, "16565": 966, "3908": 967, "28796": 968, "29978": 969, "9067": 970, "21484": 971, "28463": 972, "12393": 973, "29662": 974, "18880": 975, "17571": 976, "12355": 977, "3970": 978, "12869": 979, "22102": 980, "23320": 981, "25695": 982, "15495": 983, "5963": 984, "701": 985, "26287": 986, "13629": 987, "3802": 988, "10262": 989, "6662": 990, "5616": 991, "3794": 992, "8376": 993, "6996": 994, "20109": 995, "26490": 996, "14227": 997, "12650": 998, "23881": 999, "3923": 1000, "10363": 1001, "9797": 1002, "22209": 1003, "22686": 1004, "18399": 1005, "28046": 1006, "12330": 1007, "28721": 1008, "25014": 1009, "29387": 1010, "21278": 1011, "18064": 1012, "8762": 1013, "3101": 1014, "4288": 1015, "9140": 1016, "5011": 1017, "6963": 1018, "38": 1019, "22457": 1020, "22133": 1021, "26736": 1022, "9808": 1023, "20567": 1024, "3732": 1025, "51": 1026, "23325": 1027, "21364": 1028, "929": 1029, "3194": 1030, "27157": 1031, "17562": 1032, "8505": 1033, "7979": 1034, "12074": 1035, "23075": 1036, "10764": 1037, "23757": 1038, "19628": 1039, "13987": 1040, "17478": 1041, "13530": 1042, "29143": 1043, "15482": 1044, "7314": 1045, "395": 1046, "11122": 1047, "10696": 1048, "6832": 1049, "15859": 1050, "4870": 1051, "25801": 1052, "24124": 1053, "10162": 1054, "1723": 1055, "413": 1056, "4664": 1057, "24478": 1058, "26117": 1059, "6856": 1060, "3673": 1061, "23809": 1062, "27435": 1063, "25089": 1064, "27902": 1065, "8120": 1066, "7713": 1067, "6577": 1068, "15812": 1069, "397": 1070, "336": 1071, "16222": 1072, "8280": 1073, "20176": 1074, "7849": 1075, "19394": 1076, "10756": 1077, "628": 1078, "12773": 1079, "1864": 1080, "388": 1081, "25849": 1082, "12134": 1083, "3906": 1084, "29009": 1085, "28332": 1086, "18426": 1087, "27112": 1088, "9580": 1089, "26008": 1090, "12670": 1091, "7323": 1092, "25300": 1093, "20595": 1094, "7563": 1095, "14068": 1096, "16090": 1097, "10539": 1098, "6078": 1099, "14088": 1100, "1130": 1101, "11816": 1102, "17094": 1103, "5523": 1104, "10960": 1105, "28578": 1106, "13439": 1107, "4474": 1108, "26876": 1109, "12449": 1110, "9716": 1111, "12533": 1112, "1930": 1113, "24065": 1114, "21475": 1115, "23272": 1116, "16571": 1117, "12190": 1118, "6269": 1119, "16323": 1120, "25251": 1121, "29549": 1122, "10952": 1123, "4971": 1124, "17313": 1125, "22876": 1126, "23008": 1127, "17336": 1128, "14343": 1129, "20029": 1130, "3009": 1131, "11850": 1132, "21103": 1133, "12497": 1134, "5046": 1135, "12251": 1136, "21135": 1137, "2138": 1138, "26619": 1139, "3397": 1140, "6046": 1141, "2838": 1142, "3138": 1143, "9335": 1144, "26219": 1145, "24406": 1146, "24627": 1147, "8642": 1148, "17758": 1149, "21152": 1150, "16720": 1151, "17095": 1152, "8660": 1153, "20856": 1154, "7005": 1155, "2898": 1156, "3462": 1157, "9638": 1158, "9279": 1159, "23286": 1160, "2215": 1161, "6090": 1162, "28727": 1163, "28647": 1164, "26860": 1165, "1439": 1166, "19235": 1167, "3280": 1168, "29090": 1169, "5197": 1170, "14186": 1171, "525": 1172, "22592": 1173, "17174": 1174, "21948": 1175, "27527": 1176, "19023": 1177, "10405": 1178, "8409": 1179, "12480": 1180, "16426": 1181, "23353": 1182, "13652": 1183, "21347": 1184, "16045": 1185, "15918": 1186, "2302": 1187, "4141": 1188, "11385": 1189, "26295": 1190, "13767": 1191, "8736": 1192, "21902": 1193, "14393": 1194, "2461": 1195, "25769": 1196, "24202": 1197, "7012": 1198, "2807": 1199, "10467": 1200, "17475": 1201, "6875": 1202, "21890": 1203, "1030": 1204, "14339": 1205, "14794": 1206, "5058": 1207, "17045": 1208, "4358": 1209, "5377": 1210, "27676": 1211, "13107": 1212, "25994": 1213, "4154": 1214, "4312": 1215, "15519": 1216, "4629": 1217, "1885": 1218, "18721": 1219, "28887": 1220, "24473": 1221, "2117": 1222, "17699": 1223, "13729": 1224, "8744": 1225, "9346": 1226, "21505": 1227, "29528": 1228, "14125": 1229, "19920": 1230, "2840": 1231, "5896": 1232, "12541": 1233, "10918": 1234, "2067": 1235, "25920": 1236, "4680": 1237, "13841": 1238, "6404": 1239, "26404": 1240, "1916": 1241, "8920": 1242, "11146": 1243, "20620": 1244, "646": 1245, "17676": 1246, "5136": 1247, "16194": 1248, "3379": 1249, "24290": 1250, "20397": 1251, "14588": 1252, "129": 1253, "18337": 1254, "6267": 1255, "22105": 1256, "18636": 1257, "1268": 1258, "29829": 1259, "22890": 1260, "5482": 1261, "17308": 1262, "13289": 1263, "27180": 1264, "18346": 1265, "26197": 1266, "20779": 1267, "2592": 1268, "29065": 1269, "14614": 1270, "4965": 1271, "21954": 1272, "8342": 1273, "414": 1274, "24592": 1275, "9203": 1276, "4021": 1277, "2526": 1278, "17570": 1279, "8343": 1280, "9646": 1281, "7579": 1282, "14348": 1283, "20621": 1284, "8489": 1285, "28455": 1286, "14925": 1287, "16028": 1288, "1065": 1289, "16504": 1290, "28246": 1291, "14237": 1292, "12680": 1293, "219": 1294, "5989": 1295, "24884": 1296, "17455": 1297, "18696": 1298, "17264": 1299, "5785": 1300, "23763": 1301, "7123": 1302, "3207": 1303, "18914": 1304, "9166": 1305, "9568": 1306, "9374": 1307, "20126": 1308, "29690": 1309, "17428": 1310, "27087": 1311, "3122": 1312, "29748": 1313, "22296": 1314, "7101": 1315, "21328": 1316, "17679": 1317, "3800": 1318, "14747": 1319, "20911": 1320, "10412": 1321, "26570": 1322, "5820": 1323, "4876": 1324, "1390": 1325, "18937": 1326, "9722": 1327, "17157": 1328, "14009": 1329, "19381": 1330, "22055": 1331, "10433": 1332, "21312": 1333, "14675": 1334, "1601": 1335, "569": 1336, "2751": 1337, "591": 1338, "14440": 1339, "16022": 1340, "5290": 1341, "13319": 1342, "22586": 1343, "7565": 1344, "10576": 1345, "17715": 1346, "15454": 1347, "265": 1348, "8374": 1349, "4291": 1350, "21386": 1351, "16912": 1352, "9342": 1353, "9535": 1354, "4794": 1355, "21831": 1356, "21477": 1357, "4814": 1358, "1432": 1359, "8370": 1360, "9908": 1361, "28973": 1362, "11798": 1363, "27013": 1364, "29990": 1365, "23678": 1366, "4292": 1367, "27289": 1368, "10137": 1369, "2529": 1370, "6840": 1371, "918": 1372, "21869": 1373, "17083": 1374, "16876": 1375, "15175": 1376, "7658": 1377, "5602": 1378, "2314": 1379, "24706": 1380, "7299": 1381, "2797": 1382, "8674": 1383, "7887": 1384, "18513": 1385, "70": 1386, "24667": 1387, "22496": 1388, "19485": 1389, "19424": 1390, "813": 1391, "28754": 1392, "942": 1393, "16940": 1394, "13836": 1395, "17580": 1396, "17719": 1397, "22708": 1398, "23765": 1399, "20638": 1400, "28635": 1401, "17065": 1402, "6828": 1403, "11655": 1404, "28932": 1405, "25836": 1406, "24973": 1407, "16196": 1408, "2403": 1409, "16351": 1410, "21777": 1411, "29799": 1412, "9469": 1413, "19718": 1414, "22968": 1415, "18407": 1416, "25011": 1417, "14971": 1418, "7678": 1419, "17386": 1420, "19643": 1421, "21879": 1422, "27371": 1423, "15627": 1424, "15955": 1425, "9145": 1426, "18117": 1427, "10564": 1428, "28849": 1429, "29081": 1430, "3084": 1431, "17509": 1432, "1497": 1433, "25649": 1434, "16334": 1435, "20416": 1436, "28078": 1437, "21265": 1438, "6756": 1439, "22900": 1440, "21408": 1441, "3127": 1442, "9443": 1443, "4165": 1444, "23815": 1445, "15394": 1446, "11678": 1447, "9670": 1448, "26387": 1449, "23860": 1450, "23938": 1451, "29083": 1452, "9746": 1453, "27672": 1454, "6117": 1455, "26881": 1456, "3245": 1457, "19827": 1458, "10949": 1459, "6135": 1460, "12672": 1461, "1107": 1462, "2671": 1463, "23615": 1464, "22014": 1465, "27556": 1466, "21917": 1467, "20853": 1468, "25989": 1469, "4621": 1470, "2824": 1471, "19922": 1472, "6275": 1473, "5386": 1474, "12258": 1475, "12467": 1476, "18744": 1477, "23854": 1478, "5162": 1479, "12152": 1480, "21001": 1481, "24348": 1482, "20494": 1483, "26603": 1484, "3224": 1485, "16353": 1486, "21731": 1487, "28673": 1488, "13072": 1489, "1617": 1490, "1707": 1491, "28933": 1492, "5631": 1493, "19534": 1494, "3751": 1495, "28307": 1496, "16489": 1497, "13028": 1498, "3848": 1499, "19303": 1500, "11682": 1501, "1911": 1502, "189": 1503, "23708": 1504, "26991": 1505, "512": 1506, "1711": 1507, "8268": 1508, "28073": 1509, "21094": 1510, "6938": 1511, "19465": 1512, "28018": 1513, "12189": 1514, "4516": 1515, "17622": 1516, "29259": 1517, "16164": 1518, "15131": 1519, "10328": 1520, "26520": 1521, "27689": 1522, "21039": 1523, "6008": 1524, "25308": 1525, "24070": 1526, "22125": 1527, "8066": 1528, "9939": 1529, "23741": 1530, "13490": 1531, "1785": 1532, "20843": 1533, "2739": 1534, "40": 1535, "12246": 1536, "7141": 1537, "29126": 1538, "365": 1539, "19085": 1540, "18175": 1541, "23905": 1542, "24571": 1543, "15942": 1544, "16314": 1545, "14607": 1546, "25403": 1547, "7118": 1548, "22458": 1549, "6621": 1550, "24380": 1551, "386": 1552, "12925": 1553, "13397": 1554, "27605": 1555, "11255": 1556, "9860": 1557, "29803": 1558, "12360": 1559, "21041": 1560, "27383": 1561, "17942": 1562, "5246": 1563, "25577": 1564, "12784": 1565, "9264": 1566, "3961": 1567, "22982": 1568, "29792": 1569, "6603": 1570, "12624": 1571, "11481": 1572, "13598": 1573, "25482": 1574, "8233": 1575, "1375": 1576, "21674": 1577, "23384": 1578, "20654": 1579, "9959": 1580, "6274": 1581, "28457": 1582, "23758": 1583, "28484": 1584, "5426": 1585, "15409": 1586, "29064": 1587, "12683": 1588, "13557": 1589, "4678": 1590, "17900": 1591, "21958": 1592, "9695": 1593, "14665": 1594, "11279": 1595, "19005": 1596, "3302": 1597, "21953": 1598, "4599": 1599, "3660": 1600, "11378": 1601, "4494": 1602, "15826": 1603, "1786": 1604, "3325": 1605, "16361": 1606, "18953": 1607, "25550": 1608, "4831": 1609, "29488": 1610, "7154": 1611, "10108": 1612, "7832": 1613, "25544": 1614, "708": 1615, "26771": 1616, "13489": 1617, "12171": 1618, "20692": 1619, "14251": 1620, "22477": 1621, "11013": 1622, "25693": 1623, "14396": 1624, "20182": 1625, "27586": 1626, "19453": 1627, "19294": 1628, "3502": 1629, "24720": 1630, "14159": 1631, "13591": 1632, "19432": 1633, "21385": 1634, "28251": 1635, "9765": 1636, "8990": 1637, "4050": 1638, "24223": 1639, "22698": 1640, "17917": 1641, "11827": 1642, "21268": 1643, "17402": 1644, "2100": 1645, "21993": 1646, "29956": 1647, "14431": 1648, "10676": 1649, "2246": 1650, "4350": 1651, "22227": 1652, "26899": 1653, "1876": 1654, "26262": 1655, "4586": 1656, "7489": 1657, "3308": 1658, "16964": 1659, "22763": 1660, "13493": 1661, "15855": 1662, "29439": 1663, "12197": 1664, "2747": 1665, "6890": 1666, "25457": 1667, "29544": 1668, "4430": 1669, "19225": 1670, "18524": 1671, "14177": 1672, "29449": 1673, "1787": 1674, "19323": 1675, "8189": 1676, "6488": 1677, "27046": 1678, "12763": 1679, "7952": 1680, "12499": 1681, "17058": 1682, "90": 1683, "25991": 1684, "28340": 1685, "26056": 1686, "16816": 1687, "20791": 1688, "22284": 1689, "19758": 1690, "14148": 1691, "25900": 1692, "13889": 1693, "12631": 1694, "7706": 1695, "4272": 1696, "26305": 1697, "5380": 1698, "7902": 1699, "1562": 1700, "12614": 1701, "23922": 1702, "13768": 1703, "17003": 1704, "3594": 1705, "5450": 1706, "11638": 1707, "27509": 1708, "18445": 1709, "7893": 1710, "20828": 1711, "29147": 1712, "25297": 1713, "12656": 1714, "22451": 1715, "11387": 1716, "19891": 1717, "4470": 1718, "12109": 1719, "12760": 1720, "12699": 1721, "12274": 1722, "26575": 1723, "6182": 1724, "16223": 1725, "6728": 1726, "8283": 1727, "7612": 1728, "4614": 1729, "13707": 1730, "24801": 1731, "15901": 1732, "4666": 1733, "10155": 1734, "13716": 1735, "2779": 1736, "17981": 1737, "24117": 1738, "8212": 1739, "7353": 1740, "8385": 1741, "25437": 1742, "10152": 1743, "22515": 1744, "23480": 1745, "4953": 1746, "5412": 1747, "9662": 1748, "4765": 1749, "22288": 1750, "24445": 1751, "19374": 1752, "24806": 1753, "15179": 1754, "15157": 1755, "514": 1756, "29372": 1757, "19441": 1758, "15071": 1759, "6438": 1760, "10431": 1761, "717": 1762, "150": 1763, "29981": 1764, "2315": 1765, "23995": 1766, "12842": 1767, "22197": 1768, "8643": 1769, "24403": 1770, "23338": 1771, "12724": 1772, "1233": 1773, "26449": 1774, "6306": 1775, "14695": 1776, "2641": 1777, "7629": 1778, "29845": 1779, "12398": 1780, "22488": 1781, "15754": 1782, "10186": 1783, "11070": 1784, "27062": 1785, "21985": 1786, "24177": 1787, "29513": 1788, "17392": 1789, "251": 1790, "20315": 1791, "28514": 1792, "14719": 1793, "17374": 1794, "25276": 1795, "11922": 1796, "3816": 1797, "66": 1798, "22517": 1799, "21852": 1800, "25866": 1801, "28421": 1802, "1873": 1803, "26714": 1804, "27857": 1805, "556": 1806, "15911": 1807, "1509": 1808, "13261": 1809, "15892": 1810, "29234": 1811, "21549": 1812, "14850": 1813, "15504": 1814, "16858": 1815, "14424": 1816, "1033": 1817, "23551": 1818, "12502": 1819, "25121": 1820, "27887": 1821, "2437": 1822, "4634": 1823, "12910": 1824, "1635": 1825, "28889": 1826, "21797": 1827, "9352": 1828, "20154": 1829, "19421": 1830, "25652": 1831, "29676": 1832, "1783": 1833, "14464": 1834, "27535": 1835, "9792": 1836, "15239": 1837, "1321": 1838, "19093": 1839, "28204": 1840, "6361": 1841, "8332": 1842, "6273": 1843, "22541": 1844, "16030": 1845, "14712": 1846, "2847": 1847, "19712": 1848, "12530": 1849, "1888": 1850, "24199": 1851, "27059": 1852, "19509": 1853, "2207": 1854, "12518": 1855, "6301": 1856, "19364": 1857, "27869": 1858, "13456": 1859, "24870": 1860, "26409": 1861, "20827": 1862, "9411": 1863, "25309": 1864, "2374": 1865, "18813": 1866, "21990": 1867, "16693": 1868, "11175": 1869, "10398": 1870, "21256": 1871, "15302": 1872, "28895": 1873, "23591": 1874, "6320": 1875, "2398": 1876, "5670": 1877, "20504": 1878, "9813": 1879, "8138": 1880, "13335": 1881, "23690": 1882, "24346": 1883, "9910": 1884, "25416": 1885, "24179": 1886, "2973": 1887, "7457": 1888, "22351": 1889, "12073": 1890, "3620": 1891, "13298": 1892, "3742": 1893, "13898": 1894, "9872": 1895, "21354": 1896, "3973": 1897, "13682": 1898, "5318": 1899, "6685": 1900, "26394": 1901, "2419": 1902, "11539": 1903, "4220": 1904, "22391": 1905, "11201": 1906, "17583": 1907, "16273": 1908, "22765": 1909, "29869": 1910, "3603": 1911, "68": 1912, "24001": 1913, "26761": 1914, "11672": 1915, "25964": 1916, "15913": 1917, "915": 1918, "9510": 1919, "281": 1920, "5088": 1921, "10772": 1922, "14482": 1923, "13536": 1924, "12266": 1925, "18356": 1926, "15132": 1927, "3562": 1928, "23652": 1929, "12193": 1930, "10373": 1931, "28911": 1932, "14775": 1933, "9701": 1934, "27677": 1935, "4899": 1936, "4172": 1937, "5270": 1938, "21597": 1939, "5600": 1940, "21308": 1941, "21841": 1942, "25988": 1943, "21745": 1944, "5746": 1945, "25772": 1946, "3858": 1947, "17161": 1948, "2323": 1949, "8033": 1950, "12965": 1951, "2651": 1952, "2381": 1953, "6647": 1954, "28565": 1955, "29024": 1956, "22152": 1957, "27766": 1958, "19149": 1959, "22190": 1960, "24599": 1961, "2996": 1962, "4787": 1963, "16036": 1964, "8269": 1965, "10163": 1966, "28758": 1967, "5739": 1968, "13375": 1969, "22442": 1970, "28315": 1971, "9615": 1972, "14052": 1973, "1684": 1974, "29282": 1975, "4254": 1976, "13330": 1977, "21736": 1978, "27198": 1979, "26020": 1980, "4769": 1981, "28564": 1982, "15890": 1983, "1449": 1984, "14940": 1985, "25063": 1986, "28555": 1987, "4180": 1988, "10171": 1989, "12956": 1990, "25146": 1991, "24655": 1992, "16583": 1993, "6744": 1994, "22306": 1995, "8529": 1996, "1169": 1997, "21272": 1998, "5535": 1999, "3074": 2000, "26793": 2001, "2623": 2002, "27597": 2003, "27826": 2004, "16069": 2005, "14064": 2006, "17781": 2007, "1489": 2008, "29321": 2009, "7777": 2010, "24603": 2011, "29466": 2012, "8056": 2013, "8878": 2014, "863": 2015, "2518": 2016, "17820": 2017, "27247": 2018, "13703": 2019, "4951": 2020, "8612": 2021, "9489": 2022, "1378": 2023, "7603": 2024, "25624": 2025, "26945": 2026, "22426": 2027, "8126": 2028, "5795": 2029, "13082": 2030, "24154": 2031, "21066": 2032, "230": 2033, "8045": 2034, "9935": 2035, "12684": 2036, "29388": 2037, "26632": 2038, "20555": 2039, "5399": 2040, "11755": 2041, "13472": 2042, "14622": 2043, "15858": 2044, "6137": 2045, "20352": 2046, "5591": 2047, "1946": 2048, "8050": 2049, "23141": 2050, "29855": 2051, "24172": 2052, "7066": 2053, "20912": 2054, "26763": 2055, "9806": 2056, "6288": 2057, "16080": 2058, "11616": 2059, "20232": 2060, "14606": 2061, "18533": 2062, "2332": 2063, "15700": 2064, "14350": 2065, "19730": 2066, "7008": 2067, "12802": 2068, "26487": 2069, "27479": 2070, "10447": 2071, "23830": 2072, "24703": 2073, "18621": 2074, "4726": 2075, "5177": 2076, "20465": 2077, "11367": 2078, "23330": 2079, "17527": 2080, "20598": 2081, "7626": 2082, "1754": 2083, "1062": 2084, "14328": 2085, "10031": 2086, "22440": 2087, "14706": 2088, "19193": 2089, "29190": 2090, "28566": 2091, "964": 2092, "11007": 2093, "11645": 2094, "26371": 2095, "15067": 2096, "19644": 2097, "2262": 2098, "3691": 2099, "8151": 2100, "26767": 2101, "12942": 2102, "14026": 2103, "9711": 2104, "21882": 2105, "19017": 2106, "25115": 2107, "27772": 2108, "8644": 2109, "15888": 2110, "24182": 2111, "23534": 2112, "6702": 2113, "17389": 2114, "3523": 2115, "11082": 2116, "1262": 2117, "11055": 2118, "12649": 2119, "18657": 2120, "1073": 2121, "5849": 2122, "19046": 2123, "17280": 2124, "22314": 2125, "21828": 2126, "13668": 2127, "23196": 2128, "11066": 2129, "25290": 2130, "12573": 2131, "19952": 2132, "25779": 2133, "235": 2134, "21720": 2135, "14263": 2136, "22665": 2137, "17126": 2138, "9699": 2139, "14497": 2140, "975": 2141, "26937": 2142, "11562": 2143, "2039": 2144, "25405": 2145, "13651": 2146, "13111": 2147, "13487": 2148, "3179": 2149, "5072": 2150, "23768": 2151, "29773": 2152, "1112": 2153, "10639": 2154, "25732": 2155, "27721": 2156, "22631": 2157, "22711": 2158, "26605": 2159, "5622": 2160, "17436": 2161, "12799": 2162, "17546": 2163, "21267": 2164, "16700": 2165, "17249": 2166, "3576": 2167, "678": 2168, "8200": 2169, "21329": 2170, "6594": 2171, "21583": 2172, "22038": 2173, "21252": 2174, "6184": 2175, "14025": 2176, "8760": 2177, "25125": 2178, "27375": 2179, "25176": 2180, "15446": 2181, "22844": 2182, "28592": 2183, "25515": 2184, "6410": 2185, "8165": 2186, "8169": 2187, "3107": 2188, "20165": 2189, "23680": 2190, "28390": 2191, "23801": 2192, "23247": 2193, "7333": 2194, "29815": 2195, "28800": 2196, "18111": 2197, "8880": 2198, "10385": 2199, "26892": 2200, "11060": 2201, "7486": 2202, "0": 2203, "10807": 2204, "25670": 2205, "28597": 2206, "903": 2207, "29199": 2208, "18408": 2209, "457": 2210, "27470": 2211, "8754": 2212, "14948": 2213, "28986": 2214, "11098": 2215, "14982": 2216, "25601": 2217, "27290": 2218, "29042": 2219, "25410": 2220, "7842": 2221, "22232": 2222, "17747": 2223, "19825": 2224, "29749": 2225, "14674": 2226, "28691": 2227, "5847": 2228, "4030": 2229, "13683": 2230, "5213": 2231, "8046": 2232, "23685": 2233, "10862": 2234, "11221": 2235, "16485": 2236, "12897": 2237, "4176": 2238, "11361": 2239, "9376": 2240, "21436": 2241, "22433": 2242, "5407": 2243, "22143": 2244, "7148": 2245, "24157": 2246, "7784": 2247, "4713": 2248, "26679": 2249, "12429": 2250, "19345": 2251, "26928": 2252, "5066": 2253, "12840": 2254, "1912": 2255, "11368": 2256, "10329": 2257, "25299": 2258, "18790": 2259, "26101": 2260, "3161": 2261, "20053": 2262, "4830": 2263, "15580": 2264, "28052": 2265, "9015": 2266, "6234": 2267, "25384": 2268, "29711": 2269, "11372": 2270, "2244": 2271, "15337": 2272, "10650": 2273, "11405": 2274, "13730": 2275, "12747": 2276, "27679": 2277, "28137": 2278, "27249": 2279, "894": 2280, "2729": 2281, "8715": 2282, "7525": 2283, "9195": 2284, "2140": 2285, "10284": 2286, "29709": 2287, "9014": 2288, "17875": 2289, "20837": 2290, "10692": 2291, "27497": 2292, "12663": 2293, "24646": 2294, "19133": 2295, "7938": 2296, "21870": 2297, "13403": 2298, "2259": 2299, "6611": 2300, "18039": 2301, "28219": 2302, "23875": 2303, "6163": 2304, "18126": 2305, "3539": 2306, "11436": 2307, "2782": 2308, "18839": 2309, "4880": 2310, "18201": 2311, "8974": 2312, "19768": 2313, "22559": 2314, "25280": 2315, "13700": 2316, "24203": 2317, "187": 2318, "17": 2319, "27363": 2320, "29554": 2321, "19634": 2322, "17020": 2323, "27713": 2324, "2064": 2325, "22107": 2326, "4568": 2327, "1361": 2328, "9988": 2329, "24581": 2330, "17202": 2331, "18472": 2332, "29209": 2333, "26846": 2334, "3918": 2335, "20039": 2336, "8835": 2337, "18298": 2338, "25466": 2339, "3253": 2340, "14832": 2341, "21905": 2342, "2163": 2343, "8988": 2344, "23179": 2345, "26365": 2346, "7719": 2347, "19150": 2348, "26060": 2349, "5433": 2350, "8170": 2351, "8249": 2352, "21213": 2353, "16609": 2354, "18711": 2355, "23387": 2356, "14616": 2357, "22798": 2358, "27172": 2359, "24256": 2360, "20940": 2361, "27929": 2362, "8830": 2363, "23665": 2364, "4582": 2365, "7456": 2366, "10254": 2367, "16346": 2368, "23031": 2369, "6170": 2370, "24462": 2371, "22076": 2372, "29436": 2373, "19486": 2374, "3828": 2375, "28151": 2376, "11847": 2377, "11778": 2378, "19817": 2379, "19940": 2380, "27896": 2381, "14270": 2382, "22043": 2383, "9556": 2384, "20131": 2385, "7906": 2386, "28469": 2387, "6290": 2388, "17533": 2389, "9103": 2390, "11440": 2391, "1833": 2392, "24528": 2393, "5969": 2394, "9526": 2395, "7470": 2396, "28588": 2397, "8953": 2398, "28970": 2399, "17076": 2400, "20246": 2401, "24542": 2402, "11422": 2403, "19957": 2404, "25076": 2405, "5997": 2406, "15116": 2407, "29326": 2408, "20841": 2409, "15045": 2410, "3815": 2411, "6986": 2412, "15408": 2413, "24291": 2414, "18632": 2415, "1443": 2416, "5240": 2417, "15596": 2418, "25450": 2419, "8467": 2420, "13738": 2421, "22343": 2422, "20697": 2423, "1993": 2424, "6082": 2425, "26204": 2426, "15977": 2427, "24747": 2428, "13634": 2429, "10495": 2430, "4337": 2431, "11654": 2432, "7251": 2433, "26631": 2434, "16586": 2435, "9191": 2436, "3657": 2437, "14788": 2438, "23867": 2439, "5070": 2440, "12437": 2441, "16399": 2442, "8026": 2443, "4734": 2444, "17409": 2445, "24066": 2446, "12872": 2447, "5909": 2448, "27494": 2449, "12886": 2450, "4828": 2451, "10120": 2452, "24616": 2453, "5705": 2454, "7202": 2455, "5326": 2456, "7573": 2457, "23594": 2458, "22917": 2459, "15793": 2460, "20656": 2461, "20708": 2462, "3548": 2463, "4549": 2464, "3680": 2465, "12927": 2466, "16777": 2467, "13897": 2468, "22401": 2469, "13628": 2470, "8007": 2471, "7921": 2472, "11914": 2473, "23561": 2474, "11301": 2475, "20916": 2476, "27427": 2477, "17348": 2478, "21853": 2479, "15747": 2480, "11117": 2481, "5403": 2482, "18926": 2483, "20787": 2484, "7381": 2485, "10533": 2486, "24091": 2487, "24150": 2488, "2483": 2489, "15609": 2490, "4561": 2491, "3741": 2492, "9341": 2493, "8536": 2494, "17752": 2495, "16199": 2496, "27014": 2497, "14879": 2498, "27777": 2499, "27562": 2500, "15601": 2501, "6851": 2502, "29328": 2503, "16836": 2504, "5150": 2505, "22397": 2506, "17055": 2507, "25697": 2508, "8986": 2509, "19650": 2510, "22822": 2511, "23727": 2512, "24408": 2513, "16122": 2514, "886": 2515, "26695": 2516, "18118": 2517, "20724": 2518, "3052": 2519, "10827": 2520, "9350": 2521, "9868": 2522, "9993": 2523, "28250": 2524, "18056": 2525, "18463": 2526, "6836": 2527, "21564": 2528, "29403": 2529, "17395": 2530, "12343": 2531, "1199": 2532, "1762": 2533, "21099": 2534, "22290": 2535, "6955": 2536, "10184": 2537, "441": 2538, "28309": 2539, "10802": 2540, "5557": 2541, "2744": 2542, "4241": 2543, "5395": 2544, "8498": 2545, "14826": 2546, "13939": 2547, "24126": 2548, "14313": 2549, "3448": 2550, "24544": 2551, "22564": 2552, "18127": 2553, "25752": 2554, "12529": 2555, "9029": 2556, "12148": 2557, "2725": 2558, "27656": 2559, "11284": 2560, "18225": 2561, "27882": 2562, "18531": 2563, "24557": 2564, "17012": 2565, "26098": 2566, "22148": 2567, "17574": 2568, "8162": 2569, "3371": 2570, "26272": 2571, "5094": 2572, "18439": 2573, "14279": 2574, "10458": 2575, "11709": 2576, "10694": 2577, "9514": 2578, "19504": 2579, "23504": 2580, "9627": 2581, "368": 2582, "14423": 2583, "18786": 2584, "26328": 2585, "13420": 2586, "28888": 2587, "179": 2588, "7806": 2589, "20082": 2590, "5552": 2591, "928": 2592, "14255": 2593, "15985": 2594, "11489": 2595, "23128": 2596, "2316": 2597, "11620": 2598, "11380": 2599, "4838": 2600, "12295": 2601, "23469": 2602, "2988": 2603, "18751": 2604, "24103": 2605, "29086": 2606, "15144": 2607, "172": 2608, "15505": 2609, "2774": 2610, "29167": 2611, "358": 2612, "25265": 2613, "11806": 2614, "6285": 2615, "29049": 2616, "13372": 2617, "8140": 2618, "14770": 2619, "24565": 2620, "4410": 2621, "14089": 2622, "13486": 2623, "17705": 2624, "20793": 2625, "17401": 2626, "27840": 2627, "18433": 2628, "9863": 2629, "19278": 2630, "3221": 2631, "1192": 2632, "113": 2633, "6669": 2634, "14723": 2635, "9986": 2636, "15663": 2637, "11642": 2638, "18867": 2639, "21886": 2640, "25526": 2641, "21719": 2642, "4243": 2643, "13874": 2644, "1626": 2645, "26043": 2646, "7184": 2647, "7854": 2648, "28719": 2649, "24745": 2650, "23966": 2651, "3949": 2652, "24656": 2653, "24609": 2654, "27365": 2655, "4118": 2656, "1232": 2657, "7545": 2658, "23732": 2659, "25958": 2660, "19062": 2661, "7937": 2662, "1640": 2663, "20107": 2664, "2200": 2665, "13137": 2666, "12568": 2667, "3117": 2668, "6475": 2669, "23749": 2670, "20526": 2671, "14819": 2672, "6514": 2673, "23115": 2674, "766": 2675, "8560": 2676, "20707": 2677, "13778": 2678, "15005": 2679, "21904": 2680, "5192": 2681, "27033": 2682, "16270": 2683, "23034": 2684, "1567": 2685, "6877": 2686, "12789": 2687, "20652": 2688, "21825": 2689, "703": 2690, "4975": 2691, "12309": 2692, "20391": 2693, "23389": 2694, "16188": 2695, "13463": 2696, "7856": 2697, "4279": 2698, "18820": 2699, "16320": 2700, "21097": 2701, "13834": 2702, "9265": 2703, "8570": 2704, "12272": 2705, "14935": 2706, "2580": 2707, "27947": 2708, "35": 2709, "8949": 2710, "12871": 2711, "7627": 2712, "29067": 2713, "20425": 2714, "10882": 2715, "16892": 2716, "650": 2717, "20115": 2718, "7225": 2719, "20959": 2720, "52": 2721, "3677": 2722, "25018": 2723, "3404": 2724, "5905": 2725, "13568": 2726, "8244": 2727, "27103": 2728, "21806": 2729, "19298": 2730, "14238": 2731, "6356": 2732, "25934": 2733, "1566": 2734, "15681": 2735, "5498": 2736, "28179": 2737, "5576": 2738, "10499": 2739, "22927": 2740, "7250": 2741, "28828": 2742, "26148": 2743, "23518": 2744, "5696": 2745, "6001": 2746, "21615": 2747, "21035": 2748, "11779": 2749, "18787": 2750, "17656": 2751, "22548": 2752, "12844": 2753, "14405": 2754, "14601": 2755, "7587": 2756, "1674": 2757, "26753": 2758, "27655": 2759, "9369": 2760, "26640": 2761, "4970": 2762, "7722": 2763, "14001": 2764, "5689": 2765, "14572": 2766, "9508": 2767, "184": 2768, "13686": 2769, "29037": 2770, "5100": 2771, "4146": 2772, "1090": 2773, "27374": 2774, "3511": 2775, "24789": 2776, "11180": 2777, "5375": 2778, "26857": 2779, "9072": 2780, "15520": 2781, "19086": 2782, "5095": 2783, "20515": 2784, "27054": 2785, "20659": 2786, "18048": 2787, "28614": 2788, "12937": 2789, "6582": 2790, "8930": 2791, "26331": 2792, "13144": 2793, "27693": 2794, "29786": 2795, "27063": 2796, "14722": 2797, "10387": 2798, "23078": 2799, "15068": 2800, "23825": 2801, "8616": 2802, "27922": 2803, "3608": 2804, "20487": 2805, "14532": 2806, "21277": 2807, "356": 2808, "13782": 2809, "6064": 2810, "2240": 2811, "28158": 2812, "20392": 2813, "29506": 2814, "17739": 2815, "28236": 2816, "22030": 2817, "15056": 2818, "17560": 2819, "6930": 2820, "14536": 2821, "21801": 2822, "28914": 2823, "24119": 2824, "17154": 2825, "11220": 2826, "19709": 2827, "27853": 2828, "23436": 2829, "27098": 2830, "4948": 2831, "13630": 2832, "9423": 2833, "22088": 2834, "4457": 2835, "27804": 2836, "18564": 2837, "26024": 2838, "22920": 2839, "19279": 2840, "24249": 2841, "19604": 2842, "17564": 2843, "5789": 2844, "13061": 2845, "18312": 2846, "9490": 2847, "7589": 2848, "24041": 2849, "5183": 2850, "1546": 2851, "18574": 2852, "4898": 2853, "14070": 2854, "5268": 2855, "12821": 2856, "13677": 2857, "20767": 2858, "5809": 2859, "7732": 2860, "22767": 2861, "29520": 2862, "29497": 2863, "18414": 2864, "21460": 2865, "1651": 2866, "4484": 2867, "17788": 2868, "5157": 2869, "19884": 2870, "10657": 2871, "2787": 2872, "24511": 2873, "26806": 2874, "23918": 2875, "15976": 2876, "28821": 2877, "26041": 2878, "10503": 2879, "8321": 2880, "14619": 2881, "7147": 2882, "23217": 2883, "224": 2884, "25107": 2885, "15304": 2886, "27192": 2887, "12305": 2888, "7965": 2889, "21614": 2890, "9789": 2891, "18944": 2892, "17594": 2893, "20207": 2894, "11505": 2895, "9758": 2896, "29977": 2897, "1150": 2898, "23865": 2899, "18828": 2900, "17544": 2901, "12128": 2902, "20049": 2903, "29759": 2904, "3558": 2905, "3418": 2906, "9757": 2907, "7104": 2908, "20417": 2909, "28292": 2910, "12853": 2911, "12983": 2912, "26741": 2913, "28845": 2914, "20454": 2915, "15674": 2916, "6934": 2917, "11771": 2918, "22797": 2919, "5431": 2920, "19334": 2921, "4694": 2922, "22441": 2923, "8005": 2924, "10220": 2925, "7405": 2926, "23363": 2927, "8931": 2928, "27740": 2929, "27118": 2930, "27892": 2931, "17255": 2932, "28750": 2933, "23853": 2934, "13021": 2935, "17859": 2936, "16954": 2937, "24850": 2938, "526": 2939, "2415": 2940, "29648": 2941, "8443": 2942, "4142": 2943, "5642": 2944, "21628": 2945, "25006": 2946, "1513": 2947, "4429": 2948, "26053": 2949, "6762": 2950, "24983": 2951, "7863": 2952, "8849": 2953, "10169": 2954, "19991": 2955, "4984": 2956, "738": 2957, "3909": 2958, "23089": 2959, "18906": 2960, "20304": 2961, "17439": 2962, "6764": 2963, "26872": 2964, "9452": 2965, "9609": 2966, "973": 2967, "14639": 2968, "15962": 2969, "22779": 2970, "5625": 2971, "14030": 2972, "7167": 2973, "14617": 2974, "13145": 2975, "6937": 2976, "21075": 2977, "7448": 2978, "9050": 2979, "19600": 2980, "2341": 2981, "14491": 2982, "4648": 2983, "1564": 2984, "28080": 2985, "27812": 2986, "18838": 2987, "27077": 2988, "14203": 2989, "24449": 2990, "28824": 2991, "29022": 2992, "1653": 2993, "26781": 2994, "3993": 2995, "13271": 2996, "23625": 2997, "11572": 2998, "20639": 2999, "5874": 3000, "21087": 3001, "25583": 3002, "8817": 3003, "16783": 3004, "22549": 3005, "943": 3006, "7611": 3007, "11390": 3008, "20762": 3009, "15869": 3010, "23150": 3011, "27140": 3012, "3267": 3013, "1660": 3014, "25287": 3015, "23540": 3016, "10382": 3017, "28401": 3018, "25756": 3019, "12325": 3020, "25575": 3021, "22935": 3022, "3740": 3023, "28918": 3024, "5458": 3025, "25117": 3026, "5071": 3027, "14979": 3028, "4010": 3029, "7028": 3030, "3423": 3031, "22108": 3032, "16661": 3033, "200": 3034, "8721": 3035, "11271": 3036, "16712": 3037, "14963": 3038, "20199": 3039, "28817": 3040, "2050": 3041, "17542": 3042, "20437": 3043, "13936": 3044, "18826": 3045, "9168": 3046, "11485": 3047, "4684": 3048, "29684": 3049, "480": 3050, "4175": 3051, "19525": 3052, "6103": 3053, "20735": 3054, "13515": 3055, "23882": 3056, "11552": 3057, "27015": 3058, "4414": 3059, "6869": 3060, "24774": 3061, "3988": 3062, "4623": 3063, "16073": 3064, "25478": 3065, "11397": 3066, "2923": 3067, "17737": 3068, "28020": 3069, "24183": 3070, "11254": 3071, "9123": 3072, "23864": 3073, "3821": 3074, "25033": 3075, "26318": 3076, "16150": 3077, "19478": 3078, "10003": 3079, "6405": 3080, "6806": 3081, "21060": 3082, "12928": 3083, "20213": 3084, "22240": 3085, "6954": 3086, "7697": 3087, "19760": 3088, "13019": 3089, "3675": 3090, "7279": 3091, "23163": 3092, "8196": 3093, "28572": 3094, "16177": 3095, "13075": 3096, "11197": 3097, "6981": 3098, "26083": 3099, "22748": 3100, "9570": 3101, "14926": 3102, "5444": 3103, "13942": 3104, "3178": 3105, "4515": 3106, "8778": 3107, "2306": 3108, "18798": 3109, "12570": 3110, "19832": 3111, "29335": 3112, "29954": 3113, "8687": 3114, "15169": 3115, "7594": 3116, "15799": 3117, "15556": 3118, "19624": 3119, "3155": 3120, "28202": 3121, "14980": 3122, "23166": 3123, "12988": 3124, "7967": 3125, "2886": 3126, "26711": 3127, "4849": 3128, "26": 3129, "17111": 3130, "1573": 3131, "7289": 3132, "23841": 3133, "13539": 3134, "17735": 3135, "23409": 3136, "27139": 3137, "10791": 3138, "2444": 3139, "23760": 3140, "7034": 3141, "15875": 3142, "19255": 3143, "17851": 3144, "19599": 3145, "9119": 3146, "6192": 3147, "9906": 3148, "15894": 3149, "4772": 3150, "5948": 3151, "19577": 3152, "20073": 3153, "7640": 3154, "25202": 3155, "17211": 3156, "14544": 3157, "21291": 3158, "23898": 3159, "8938": 3160, "13837": 3161, "2481": 3162, "27468": 3163, "22795": 3164, "1734": 3165, "2048": 3166, "5027": 3167, "6444": 3168, "28016": 3169, "16238": 3170, "22916": 3171, "3754": 3172, "11086": 3173, "29077": 3174, "11782": 3175, "3947": 3176, "22470": 3177, "15110": 3178, "21316": 3179, "26542": 3180, "26121": 3181, "26308": 3182, "13759": 3183, "15623": 3184, "7590": 3185, "12694": 3186, "22200": 3187, "11689": 3188, "10327": 3189, "26240": 3190, "22777": 3191, "17244": 3192, "16094": 3193, "26186": 3194, "24191": 3195, "27967": 3196, "11452": 3197, "21795": 3198, "19231": 3199, "23799": 3200, "8153": 3201, "29533": 3202, "8596": 3203, "14198": 3204, "13952": 3205, "5982": 3206, "12442": 3207, "11799": 3208, "16292": 3209, "24645": 3210, "6480": 3211, "7157": 3212, "16711": 3213, "10793": 3214, "14004": 3215, "14007": 3216, "22309": 3217, "1044": 3218, "17974": 3219, "27152": 3220, "25889": 3221, "1984": 3222, "24466": 3223, "2234": 3224, "12179": 3225, "8088": 3226, "19696": 3227, "6294": 3228, "3047": 3229, "17482": 3230, "7332": 3231, "19591": 3232, "859": 3233, "24872": 3234, "24106": 3235, "3332": 3236, "17106": 3237, "1477": 3238, "8251": 3239, "11896": 3240, "5176": 3241, "6023": 3242, "22300": 3243, "4882": 3244, "14609": 3245, "1507": 3246, "28473": 3247, "5368": 3248, "873": 3249, "12069": 3250, "13206": 3251, "24729": 3252, "23703": 3253, "847": 3254, "1460": 3255, "7183": 3256, "853": 3257, "20337": 3258, "11101": 3259, "8587": 3260, "20191": 3261, "23180": 3262, "20105": 3263, "25413": 3264, "5413": 3265, "11736": 3266, "9686": 3267, "20680": 3268, "25621": 3269, "2551": 3270, "22161": 3271, "24903": 3272, "5939": 3273, "26489": 3274, "28505": 3275, "7181": 3276, "4144": 3277, "2931": 3278, "9192": 3279, "7570": 3280, "23834": 3281, "15557": 3282, "11107": 3283, "6500": 3284, "1878": 3285, "22802": 3286, "19006": 3287, "5761": 3288, "14754": 3289, "21410": 3290, "23187": 3291, "29704": 3292, "28338": 3293, "25274": 3294, "16420": 3295, "19994": 3296, "24444": 3297, "27039": 3298, "17551": 3299, "7487": 3300, "13909": 3301, "6745": 3302, "12525": 3303, "14045": 3304, "6656": 3305, "29193": 3306, "26118": 3307, "14178": 3308, "7517": 3309, "21559": 3310, "8340": 3311, "7350": 3312, "28378": 3313, "16698": 3314, "18415": 3315, "2610": 3316, "15429": 3317, "7268": 3318, "5659": 3319, "19067": 3320, "16475": 3321, "17347": 3322, "27904": 3323, "21029": 3324, "15651": 3325, "26915": 3326, "7499": 3327, "13283": 3328, "3186": 3329, "17929": 3330, "22687": 3331, "24763": 3332, "3266": 3333, "18403": 3334, "28364": 3335, "27894": 3336, "27367": 3337, "16020": 3338, "8819": 3339, "12867": 3340, "7816": 3341, "17644": 3342, "3903": 3343, "23259": 3344, "23431": 3345, "18149": 3346, "1681": 3347, "29304": 3348, "19428": 3349, "12432": 3350, "12919": 3351, "12758": 3352, "6167": 3353, "19579": 3354, "12475": 3355, "14136": 3356, "16447": 3357, "7041": 3358, "5332": 3359, "2644": 3360, "25022": 3361, "29134": 3362, "8114": 3363, "9055": 3364, "2179": 3365, "21918": 3366, "26832": 3367, "10850": 3368, "1921": 3369, "10172": 3370, "20413": 3371, "28838": 3372, "25179": 3373, "13194": 3374, "28411": 3375, "10103": 3376, "7359": 3377, "15255": 3378, "23664": 3379, "18616": 3380, "2309": 3381, "19075": 3382, "14074": 3383, "23707": 3384, "69": 3385, "2129": 3386, "3836": 3387, "1780": 3388, "17219": 3389, "24292": 3390, "97": 3391, "20290": 3392, "7737": 3393, "25852": 3394, "8562": 3395, "4584": 3396, "18569": 3397, "13069": 3398, "19222": 3399, "19665": 3400, "8722": 3401, "14262": 3402, "15692": 3403, "16681": 3404, "20549": 3405, "12461": 3406, "18185": 3407, "19168": 3408, "22116": 3409, "18731": 3410, "199": 3411, "1902": 3412, "16825": 3413, "28397": 3414, "18717": 3415, "25178": 3416, "12571": 3417, "15833": 3418, "10232": 3419, "11339": 3420, "13347": 3421, "26875": 3422, "22439": 3423, "16405": 3424, "14756": 3425, "135": 3426, "18673": 3427, "8103": 3428, "20619": 3429, "25291": 3430, "20994": 3431, "23346": 3432, "7826": 3433, "5397": 3434, "10545": 3435, "20825": 3436, "7935": 3437, "17653": 3438, "25543": 3439, "25236": 3440, "13338": 3441, "17125": 3442, "18875": 3443, "4126": 3444, "29535": 3445, "24283": 3446, "13017": 3447, "29862": 3448, "3015": 3449, "5313": 3450, "9453": 3451, "8740": 3452, "2128": 3453, "14874": 3454, "15800": 3455, "15361": 3456, "2059": 3457, "5633": 3458, "3571": 3459, "25498": 3460, "12658": 3461, "1313": 3462, "25048": 3463, "29273": 3464, "22498": 3465, "16243": 3466, "253": 3467, "23883": 3468, "20353": 3469, "4506": 3470, "3205": 3471, "6907": 3472, "5478": 3473, "15947": 3474, "7007": 3475, "9012": 3476, "8728": 3477, "12810": 3478, "14655": 3479, "12022": 3480, "3018": 3481, "4208": 3482, "6895": 3483, "8471": 3484, "1367": 3485, "19819": 3486, "5424": 3487, "14776": 3488, "8407": 3489, "13881": 3490, "11543": 3491, "19666": 3492, "21522": 3493, "12973": 3494, 